app/Models/PaketBarangModels.php

    public function datapackagingbarang()
    {
        return $this->db->table('tb_packaging')->Get()->getResultArray();
---
SELECT *
FROM `tb_packaging`

    public function datapayperiode()
    {
        return $this->db->table('tb_pay_periode')->Get()->getResultArray();
---
SELECT *
FROM `tb_pay_periode`

    public function datapaketbarang()
    {
        return $this->db->table('tb_paket')->Get()->getResultArray();
---
SELECT *
FROM `tb_paket`

    public function datakategoribarang()
    {
        return $this->db->table('tb_kategori')->Get()->getResultArray();
---
SELECT *
FROM `tb_kategori`