app/Models/PengambilanPaketBarangModels.php

    public function get_all_barang_supplier()
    {
        return $this->db->table('tb_sup_barang')->get()->getResultArray();
---
SELECT *
FROM `tb_sup_barang`

    public function get_all_supplier()
    {
        return $this->db->table('tb_supplier')->get()->getResultArray();
---
SELECT *
FROM `tb_supplier`

    public function get_all_barang()
    {
        return $this->db->table('tb_barang')->get()->getResultArray();
---
SELECT *
FROM `tb_barang`